
/* ClearVue/LC current software version 1.0 */
/* Last Modified - Wednesday, October 17, 1990 4:31:24 PM */
/* © Raster Ops Corp., 1988, 1989, 1990    All Rights Reserved
   Written:    Thu Jan  4, 1990     Wade D. Eilrich in Aztec C V3.6B
   Modified from the source code for the 108+ V1.4 rom which was written 
   by Wade Eilrich using Aztec C V3.6B.
			   
   Parts of this code were modified from the example driver in the Apple book:
	"Designing Cards and Drivers for Macintosh II and Macintosh SE"
			      
   Changes for ClearVue/LC and beyond Wednesday, October 17, 1990 2:08:33 PM
   by Jim Huffman
			   
*/
/*  Wednesday, October 17, 1990 2:08:45 PM  Version 1.0 ClearVue/LC */
/* **********************      	  CONSTANTS        ******************* */
#define  _DRIVER
#ifndef MAKINGGS
 #define MAKINGGS 0
#endif
#if MAKINGGS
#define MAKINGGS 1
#asm
MAKINGGS EQU 1
#endasm
#else
#asm
MAKINGGS EQU 0
#endasm
#endif
#define TMS34061       0x00040000 		/* 34061 Address */
#define VIDINTERRUPT   0x000400B8 		/* Hi byte of Control1 */
#define UTILADDRESS    0x00080000 		/* Utility Register */
#define SLOTFss        0xFFF00000		/* Slot Fss00000 */
#define VStartBlankLo 0x00040060
#define VStartBlankHi 0x00040068
#define VCountLo      0x00040110
#define VCountHi      0x00040118
#define VTotalLo	  0x00040070
#define VTotalHi	  0x00040078
#define	pix1	0x80    /* 1-bit  per pixel */
#asm
TMS34061	EQU		$00040000
UTILREG		EQU		$00080000	; Utility Register Address
MONMASK     EQU    	$100		; Bit 8 is the monitor present line
OSCASEL		EQU		$0			; Oscillator select bit 0
OSCBSEL		EQU		$1			; Oscillator select bit 1
#endasm
#define grey1a 0xAAAAAAAA  	/* 1-bit, first  half of the dithered gray pattern */ 
#define grey1b 0x55555555  	/* 1-bit, second half of the dithered gray pattern */ 
#define MAXLUT        3	    	/* There are three (RGB) lookup tables associated with each DAC */
#define SCRNWID1024 256     	/* Width of the screen in long integers (1024/4 = 256) */
#define SCRNLEN1024 435     	/* Last row on the 1024 x 870 screen */
#define PIXSTART   0x80		/* Starting mode for the pixel depths (0x80 = 1 bit) */
#define EIGHTBIT      8		/* Shift constant used in LUTtranslate */
#include "zoom.h"
enum OSErrors
{
  controlErr = -17,
  statusErr  = -18,
  openErr    = -23
};
enum ScreenModes
{
  mode1024   = 1024,
  mode640    =  640,
};
/* No interlace */  
enum SetInterrupts
{
  interruptOn      = 0x74,
  interruptLaceOn  = 0x76,
  interruptOff     = 0x70,
  interruptLaceOff = 0x72
};
enum ZoomDefs
{
  x1 = 0,
  x2,
  x4
};
enum panStatusTypes
{
  getPanRate = 8192,	/* GetPanRate()	get the scaling factor for the x/y panning rate.     */
  getSlow,		/* GetSlow()	get the slow panning speed. 			     */
  getFast,		/* GetFast()	get the fast panning speed. 			     */
  getMargin,	/* GetMargin()	get the width (in pixels) of the slow panning area.  */
  getZoom,		/* GetZoom()	get the current zoom state (1 = x1, 2 = x2, 3 = x4.) */
  getRects,		/* GetRects()	get the fast and slow panning rectangles and speeds. */
  getXY,		/* GetXY()      get the currentX and currentY screen positions.	     */
  getAll,		/* GetAll()		get all the various parameters			     */
  getPZMode,	/* GetPZMode()  get the pixel mode				     */
  getPZ			/* GetPZ()		get the pan & zoom enable flag			     */
};
enum panControlTypes
{
  zoomIn = 8192,	/* ZoomIn()	zoom in.     	 	     			     */
  zoomOut,		/* ZoomOut()	zoom out. 			     		     */
  panX,			/* PanX()		pan in the x direction. 	  		     */
  panY,			/* PanY()		pan in the y direction.  	   		     */
  panTo,		/* PanTo()		pan to x,y  			 		     */
  setRects, 	/* SetRects()	set the fast and slow panning rectangles. 	     */
  setXY,		/* SetXY()		set the X,Y coordinates (screen top left)	     */
  setSlow,		/* SetSlow()	set the slow panning rate			     */
  setFast,		/* SetFast()	set the fast panning rate			     */
  setBorder,	/* SetBorder()  set the panning border width			     */
  setPZ,		/* SetPZ()		enable panning and zooming			     */
};
/* Driver storage */
typedef struct mystorage
{
  SlotIntQElement *myslotqeleptr;	/* 768 */
  unsigned char *myintrptcode;		/* 772 */
  unsigned short bwmapping;			/* 776 */
  unsigned short mode;				/* 778 */
  unsigned short pages;				/* 780 */
  unsigned short zoom;				/* 782 */
  unsigned short screensize;		/* 784 */
  unsigned long  screenbase;		/* 786 */
  Boolean InterruptFlag;			/* True if interrupts are enabled, false otherwise		*/
	/* Required for Pan/Zoom */
  short slot;			/* Slot and driver refNum of the video board		*/
  short refNum;
  short currentRate;	/* The proportional value for scaling x/y pan rates 		*/
  short currentZoom;	/* Zoom state: 1 = 1X, 2 = 2X, 3 = 4X 				*/
  short fastSpeed;		/* Fast multiplier for the pan rate 				*/
  short slowSpeed;		/* Slow multiplier for the pan rate 				*/
  short currentX;		/* The value in the pan register 				*/
  short currentY;		/* Aggregate number from the two y-registers 			*/
  short xSize;			/* 1024 x 768, 680 x 870 				*/
  short ySize;
  short theMode;		/* The pixel depth: 0 = 1 bit, 1 = 2 bit, 2 = 4 bit, 3 = 8 bit 	*/
  short border;			/* The border constant which defines the panRect 		*/
  Rect theRect;			/* The rect of our GDevice					*/
  Rect panRect;			/* The border of the active panning area			*/
