
/* 708+/LC, ClearVueGS/LC current software version 1.0 */
/* Last Modified - Monday, October 1, 1990 4:52:14 PM */
/* © Raster Ops Corp., 1988, 1989, 1990    All Rights Reserved
   Written:    Thu Jan  4, 1990     Wade D. Eilrich in Aztec C V3.6B
   Modified from the source code for the 108+ V1.4 rom which was written 
   by Wade Eilrich using Aztec C V3.6B.
			   
   Parts of this code were modified from the example driver in the Apple book:
	"Designing Cards and Drivers for Macintosh II and Macintosh SE"
			      
   Changes for 708+/LC and beyond Thursday, September 20, 1990 4:21:48 PM
   by Jim Huffman
			   
*/
/*  Wednesday, September 26, 1990 12:28:31 PM  Version 1.0 708+/LC */
/* **********************      	  CONSTANTS        ******************* */
#define  _DRIVER
#ifndef MAKINGGS
 #define MAKINGGS 0
#endif
#if MAKINGGS
#define MAKINGGS 1
#asm
MAKINGGS EQU 1
#endasm
#else
#asm
MAKINGGS EQU 0
#endasm
#endif
#define TMS34061       0x000C0000 		/* 34061 Address */
#define VIDINTERRUPT   0x000C00B8 		/* Hi byte of Control1 */
#define UTILADDRESS    0x000D0000 		/* Utility Register */
#define DACADDRESS     0x000E0000 		/* DAC Address Register */
#define DACDATA        0x000E0004 		/* DAC Data (Palette) Register */
#define DACMASK        0x000E0008 		/* DAC Mask Register */
#define SLOTFss        0xFFF00000		/* Slot Fss00000 */
#define VStartBlankLo 0x000C0060
#define VStartBlankHi 0x000C0068
#define VCountLo      0x000C0110
#define VCountHi      0x000C0118

#define grey8b 0x00FF00FF	/* 8-bit, second half of the dithered gray pattern */ 
#define MAXLUT        3	    	/* There are three (RGB) lookup tables associated with each DAC */
#define SCRNWID1024 256     	/* Width of the screen in long integers (1024/4 = 256) */
#define SCRNLEN1024 435     	/* Last row on the 1024 x 870 screen */
#define PIXSTART   0x80		/* Starting mode for the pixel depths (0x80 = 1 bit) */
#define EIGHTBIT      8		/* Shift constant used in LUTtranslate */
#include "zoom.h"
enum OSErrors
{
  controlErr = -17,
  statusErr  = -18,
  openErr    = -23
};
enum ScreenModes
{
  mode1024   = 1024,
  mode640    =  640,
};
enum ClockSpeeds
{
  clk1024   = 0x0100,
  clk800    = 0x0101,
  clk640    = 0x0102,
  clkCustom = 0x0100
};
/* No interlace */  
enum SetInterrupts
{
  interruptOn      = 0x74,
  interruptLaceOn  = 0x76,
  interruptOff     = 0x70,
  interruptLaceOff = 0x72
};
enum DACblacks
{
  black1 = 0x80,
  black2 = 0xC0,
  black4 = 0xF0,
  black8 = 0xFF
};
  
#define	pix1	0x80    /* 1-bit  per pixel */
#define	pix2	0x81    /* 2-bits per pixel */
#define	pix4	0x82    /* 4-bits per pixel */
#define	pix8	0x83    /* 8-bits per pixel */
    
enum DACcolors
{
  myBlack = 0,
  myWhite = 0xFF,
  myClear = -1
};
/* Take index given and shift left 8 => pixel size */ 
enum DACcolorAddr
{
  DAC1024white = 0,
  DAC800white  = 0,
  DAC640white  = 0,
  DAC1024black = 0x80,
  DAC800black  = 0x80,
  DAC640black  = 0x80
};
enum ZoomDefs
{
  x1 = 0,
  x2,
  x4
};
enum panStatusTypes
{
  getPanRate = 8192,	/* GetPanRate()	get the scaling factor for the x/y panning rate.     */
  getSlow,		/* GetSlow()	get the slow panning speed. 			     */
  getFast,		/* GetFast()	get the fast panning speed. 			     */
  getMargin,	/* GetMargin()	get the width (in pixels) of the slow panning area.  */
  getZoom,		/* GetZoom()	get the current zoom state (1 = x1, 2 = x2, 3 = x4.) */
  getRects,		/* GetRects()	get the fast and slow panning rectangles and speeds. */
  getXY,		/* GetXY()      get the currentX and currentY screen positions.	     */
  getAll,		/* GetAll()		get all the various parameters			     */
  getPZMode,	/* GetPZMode()  get the pixel mode				     */
  getPZ			/* GetPZ()		get the pan & zoom enable flag			     */
};
enum panControlTypes
{
  zoomIn = 8192,	/* ZoomIn()	zoom in.     	 	     			     */
  zoomOut,		/* ZoomOut()	zoom out. 			     		     */
  panX,			/* PanX()		pan in the x direction. 	  		     */
  panY,			/* PanY()		pan in the y direction.  	   		     */
  panTo,		/* PanTo()		pan to x,y  			 		     */
  setRects, 	/* SetRects()	set the fast and slow panning rectangles. 	     */
  setXY,		/* SetXY()		set the X,Y coordinates (screen top left)	     */
  setSlow,		/* SetSlow()	set the slow panning rate			     */
  setFast,		/* SetFast()	set the fast panning rate			     */
  setBorder,	/* SetBorder()  set the panning border width			     */
  setPZ,		/* SetPZ()		enable panning and zooming			     */
};
/* Gamma Formula struct - we don't use this yet, except to declare space in our GammaTable struct */
typedef struct GammaFormula
{
  /* Str255 theFormula; */
} GammaFormula, *GammaFormulaPtr;
/* Gamma Data struct */
typedef struct GammaData
{
  unsigned char gRTable[256];
  unsigned char gGTable[256];
  unsigned char gBTable[256];
} GammaData, *GammaDataPtr;
/* Gamma table header block */
typedef struct GammaTable
{
  short gVersion;
  short gType;
  short gFormulaSize;
  short gChanCnt;
  short gDataCnt;
  short gDataWidth;
  /* GammaFormula gFormulaData; */
  GammaData gData;
}GammaTable, *GammaTablePtr;
      
/* Driver control gamma parameter block */
typedef struct VDGamRecord
{
  GammaTablePtr csGTablePtr;
} VDGamRecParam, *VDGamRecPtr;
/* Vertical Blanking structure */
typedef union VBlank
{
  struct VBytes
  {
    char loByte;
    char hiByte;
  } VBytes;
  short vWord;
} VBlank;
/* Driver storage */
typedef struct mystorage
{
  unsigned char clut[768];			/* 0   */
  SlotIntQElement *myslotqeleptr;	/* 768 */
  unsigned char *myintrptcode;		/* 772 */
  unsigned short bwmapping;			/* 776 */
  unsigned short mode;				/* 778 */
  unsigned short pages;				/* 780 */
  unsigned short zoom;				/* 782 */
  unsigned short screensize;		/* 784 */
  unsigned long  screenbase;		/* 786 */
  unsigned char dacdata[1024];		/* Storage for calculated DAC color values to be spooled by the slot VBL tasker. */
  Boolean InterruptFlag;			/* True if interrupts are enabled, false otherwise		*/
  GammaTablePtr gammaPtr;			/* Pointer to our gamma table data 				*/
	/* Required for Pan/Zoom */
  short slot;			/* Slot and driver refNum of the video board		*/
  short refNum;
  short currentRate;	/* The proportional value for scaling x/y pan rates 		*/
  short currentZoom;	/* Zoom state: 1 = 1X, 2 = 2X, 3 = 4X 				*/
  short fastSpeed;		/* Fast multiplier for the pan rate 				*/
  short slowSpeed;		/* Slow multiplier for the pan rate 				*/
  short currentX;		/* The value in the pan register 				*/
  short currentY;		/* Aggregate number from the two y-registers 			*/
  short xSize;			/* 1024 x 768, 680 x 870 				*/
  short ySize;
  short theMode;		/* The pixel depth: 0 = 1 bit, 1 = 2 bit, 2 = 4 bit, 3 = 8 bit 	*/
